Repository: mo-ah-dawood/simple
Catalog: simple/lib/l10n/app_*.arb
Languages: ar, fr, ur

# yearsPlural
source: {count,plural, =0{} =1{one year} =2{Two years} other{{count} years}}
ar: {count,plural, =0{} =1{عام واحد} =2{عامين} few{{count} أعوام}} other{{count} عام}}
fr: {count,plural, =0{} =1{un ans} =2{deux ans} few{{count} années}} other{{count} années}}
ur: {count,plural, =0{} =1{ایک سال} =2{دو سال} few{{count} سال}} other{{count} سال}}

# monthsPlural
source: {count,plural, =0{} =1{one month} =2{two months} other{{count} months}}
ar: {count,plural, =0{} =1{شهر واحد} =2{شهرين} few{{count} أشهر}} other{{count} شهر}}
fr: {count,plural, =0{} =1{un mois} =2{deux mois} few{{count} mois}} other{{count} mois}}
ur: {count,plural, =0{} =1{ایک مہینہ} =2{دو ماہ} few{{count} مہینہ}} other{{count} مہینہ}}

# daysPlural
source: {count,plural, =0{} =1{one day} =2{two days} other{{count} days}}
ar: {count,plural, =0{} =1{يوم واحد} =2{يومين} few{{count} أيام}} other{{count} يوم}}
fr: {count,plural, =0{} =1{un seul jour} =2{deux jours} few{{count} jours}} other{{count} jours}}
ur: {count,plural, =0{} =1{ایک دن} =2{دو دن} few{{count} دن}} other{{count} دن}}

# weeksPlural
source: {count,plural, =0{} =1{one week} =2{two weeks} other{{count} weeks}}
ar: {count,plural, =0{} =1{أسبوع واحد} =2{أسبوعين} few{{count} أسابيع}} other{{count} أسبوع}}
fr: {count,plural, =0{} =1{une semaine} =2{deux semaines} few{{count} semaines}} other{{count} semaines}}
ur: {count,plural, =0{} =1{ایک ہفتہ} =2{دو ہفتے} few{{count} ہفتے}} other{{count} ہفتے}}

# hoursPlural
source: {count,plural, =0{} =1{one hour} =2{two hours} other{{count} hours}}
ar: {count,plural, =0{} =1{ساعة واحدة} =2{ساعتين} few{{count} ساعات}} other{{count} ساعة}}
fr: {count,plural, =0{} =1{une heure} =2{deux heures} few{{count} heures}} other{{count} heures}}
ur: {count,plural, =0{} =1{ایک گھنٹہ} =2{دو گھنٹے} few{{count} گھنٹے}} other{{count} گھنٹے}}

# minutesPlural
source: {count,plural, =0{} =1{one minute} =2{two minutes} other{{count} minutes}}
ar: {count,plural, =0{} =1{دقيقة واحدة} =2{دقيقتين} few{{count} دقائق}} other{{count} دقيقة}}
fr: {count,plural, =0{} =1{une minute} =2{deux minutes} few{{count} minutes}} other{{count} minutes}}
ur: {count,plural, =0{} =1{ایک منٹ} =2{دو منٹ} few{{count} منٹ}} other{{count} منٹ}}

# socondsPlural
source: {count,plural, =0{} =1{one seconds} =2{two seconds} other{{count} seconds}}
ar: {count,plural, =0{} =1{ثانية واحدة} =2{ثانيتين} few{{count} ثواني}} other{{count} ثانية}}
fr: {count,plural, =0{} =1{une seconde} =2{deux secondes} few{{count} secondes}} other{{count} secondes}}
ur: {count,plural, =0{} =1{ایک سیکنڈ} =2{دو سیکنڈ} few{{count} سیکنڈ}} other{{count} سیکنڈ}}

source: now
ar: الآن
fr: à présent
ur: ابھی

# mustBeDateAfter
source: You must enter a later date for {after}
ar: يجب إدخال تاريخ لاحق ل {after}
fr: Vous devez entrer une date ultérieure pour {after}
ur: {after} کے لیے بعد کی تاریخ درج کرنا ضروری ہے

# mustBeDateBefore
source: You must enter an earlier date for {before}
ar: يجب إدخال تاريخ سابق ل {before}
fr: Vous devez entrer une date antérieure pour {before}
ur: آپ کو پہلے کی تاریخ درج کرنا ضروری ہے {before}

# mustBeDouble
source: You must enter a decimal number
fr: Vous devez entrer un nombre décimal
ur: آپ کو ایک دشملو نمبر درج کرنا ضروری ہے

# mustBeFacbookPageOrProfile
source: You must enter a Facbook link
ar: يجب إدخال رابط Facbook
fr: Vous devez saisir un lien Facebook
ur: آپ کو ایک فیکبک لنک درج کرنا ہوگا

# mustBeGitHubUser
source: You must enter a Github account link
fr: Vous devez saisir un lien de compte Github
ur: آپ کو ایک Github اکاؤنٹ لنک درج کرنا ہوگا

# mustBeHexColor
source: You must enter a correct color such as (#ff0000)
ar: يجب إدخال لون صحيح مثل (#ff0000)
fr: Vous devez entrer une couleur correcte telle que (#ff0000)
ur: آپ کو صحیح رنگ درج کرنا ہوگا جیسے (#ff0000)

# mustBeInstagramUser
source: Instagram account link must be entered
fr: Le lien du compte Instagram doit être saisi
ur: Instagram اکاؤنٹ کا لنک درج ہونا ضروری ہے

# mustBeInteger
source: You must enter a non-decimal number
ar: يجب إدخال رقم غير عشري
fr: Vous devez entrer un nombre non décimal
ur: آپ کو ایک غیر دشملو نمبر درج کرنا ضروری ہے

# mustBeInternationalEgyptianPhone
source: You must enter an Egyptian number in the international format such as (2015xxxxxxxx)
ar: يجب إدخال رقم مصري بالصيغة الدولية مثل (2015xxxxxxxx)
fr: Vous devez entrer un numéro égyptien au format international tel que (2015xxxxxxxx)
ur: آپ کو بین الاقوامی شکل میں ایک مصری نمبر درج کرنا ہوگا جیسے (2015xxxxxxxx)

# mustBeInternationalKsaPhone
source: You must enter a Saudi number in the international format such as (96605xxxxxxxx)
ar: يجب إدخال رقم سعودي بالصيغة الدولية مثل (96605xxxxxxxx)
fr: Vous devez entrer un numéro saoudien au format international tel que (96605xxxxxxxx)
ur: آپ کو بین الاقوامی شکل میں سعودی نمبر درج کرنا ہوگا جیسے (96605xxxxxxxx)

# mustBeLinkedinUser
source: Linkedin account link must be entered
fr: Le lien du compte Linkedin doit être saisi
ur: لنکڈین اکاؤنٹ کا لنک درج ہونا ضروری ہے

# mustBeLocaleEgyptianPhone
source: You must enter a local Egyptian number such as (015xxxxxxxx)
ar: يجب إدخال رقم مصري محلي مثل (015xxxxxxxx)
fr: Vous devez entrer un numéro égyptien local tel que (015xxxxxxxx)
ur: آپ کو مقامی مصری نمبر درج کرنا ہوگا جیسے (015xxxxxxxx)

# mustBeLocaleKsaPhone
source: You must enter a local Saudi number such as (05xxxxxxxx)
ar: يجب إدخال رقم سعودي محلي مثل (05xxxxxxxx)
fr: Vous devez entrer un numéro saoudien local tel que (05xxxxxxxx)
ur: آپ کو ایک مقامی سعودی نمبر درج کرنا ہوگا جیسے (05xxxxxxxx)

# mustBeNumber
source: You must enter a number
ar: يجب إدخال رقم
fr: Vous devez entrer un numéro
ur: آپ کو ایک نمبر درج کرنا ہوگا

# mustBePhone
source: You must enter a valid phone
fr: Vous devez entrer un téléphone valide
ur: آپ کو ایک درست فون درج کرنا ضروری ہے

# mustBeRedditUser
source: Reddit account link must be entered
fr: Le lien du compte Reddit doit être saisi
ur: ریڈٹ اکاؤنٹ کا لنک درج ہونا ضروری ہے

# mustBeSnapchatProfile
source: You must enter a Snapchat account link
ar: يجب إدخال رابط حساب Snapchat
fr: Vous devez saisir un lien de compte Snapchat
ur: آپ کو ایک سنیپ چیٹ اکاؤنٹ لنک درج کرنا ہوگا

# mustBeTimeOfDayAfter
source: You must enter a later time to {after}
ar: يجب إدخال وقت لاحق ل {after}
fr: Vous devez entrer ultérieurement pour {after}
ur: آپ کو بعد میں داخل ہونا ضروری ہے {after}

# mustBeTimeOfDayBefore
source: You must enter an earlier time to {before}
ar: يجب إدخال وقت سابق ل {before}
fr: Vous devez entrer une date antérieure pour {before}
ur: آپ کو پہلے وقت میں داخل ہونا ضروری ہے {before}

# mustBeTwitterUser
source: Twitter account link must be entered
ar: يجب إدخال رابط حساب Twitter
fr: Le lien du compte Twitter doit être saisi
ur: ٹویٹر اکاؤنٹ کا لنک درج ہونا ضروری ہے

# mustBeYoutubeUrl
source: Youtube link must be entered
fr: Le lien Youtube doit être saisi
ur: یو ٹیوب لنک داخل ہونا ضروری ہے

# mustEmail
source: You must enter a valid email
fr: Vous devez entrer un e-mail valide
ur: آپ کو ایک درست ای میل درج کرنا ضروری ہے

# mustUrl
source: You must enter a valid link
fr: Vous devez saisir un lien valide
ur: آپ کو ایک درست لنک درج کرنا ضروری ہے

# required
source: Excuse me! This field is required
ar: عذرا! هذا الحقل مطلوب
fr: Excuse-moi! Ce champ est obligatoire
ur: معذرت! اس کو پر کرنا ضروری ہے

# stringMaxLength
source: The text must be no longer than {max}
ar: يجب أن لا يزيد طول النص عن {max}
fr: Le texte ne doit pas dépasser {max}
ur: متن {max} سے زیادہ نہیں ہونا چاہیے

# stringMinLength
source: The length of the text must be at least {min}
ar: يجب أن لا يقل طول النص عن {min}
fr: La longueur du texte doit être d'au moins {min}
ur: متن کی لمبائی کم از کم {min} ہونی چاہیے

# stringMustBeInRange
source: You must enter a text of length not less than {min} and not more than {max}
ar: يجب إدخال نص لايقل طوله عن {min} ولا يزيد عن {max}
fr: Vous devez saisir un texte d'une longueur d'au moins {min} et d'au plus {max}
ur: آپ کو طوالت کا متن درج کرنا چاہیے جو {min} سے کم نہ ہو اور {max} سے زیادہ نہ ہو۔

# stringMustBeDateTime
source: You must enter a valid date
ar: يجب إدخال تاريخ صحيح
fr: Vous devez entrer une date valide
ur: آپ کو ایک درست تاریخ درج کرنی ہوگی۔

# stringMustBeTimeOfDay
source: You must enter a valid time
ar: يجب إدخال وقت صحيح
fr: Vous devez entrer une heure valide
ur: آپ کو ایک درست وقت درج کرنا ہوگا۔
